Repository: wangchong2023/zhiyu
Catalog: Sources/Localization/Settings.xcstrings
Source language: zh_hans
Languages: en

# settings.aboutApp
source: 关于
en: ZhiYu

# settings.aboutDescription
source: 本地优先的知识管理应用，AI 驱动，数据始终保留在本地设备。
en: A local-first knowledge management app with AI-powered features. Your data stays on your device.

# settings.accentColor
source: 主题色
en: Accent Color

# settings.advancedMaintenance
source: 高级维护与数据管理
en: Advanced Maintenance & Data Management

# settings.appearance
source: 外观设置
en: Appearance

# settings.biometricProtection
source: 面容 ID / 指纹保护
en: Biometric Protection

# settings.build
source: 构建号
en: Build

# settings.cancel
source: 取消
en: Cancel

# settings.clearAll
source: 清空全部数据
en: Clear All Data

# settings.clearAll.action
source: 立即清空
en: Clear Now

# settings.clearAll.confirmTitle
source: 清空所有数据
en: Clear All Data

# settings.clearAll.message
source: 此操作将物理删除本地磁盘上的所有笔记，此过程不可逆。
en: This will physically delete all notes from local disk. This is irreversible.

# settings.clearAll.success
source: 数据已清空
en: Data cleared successfully

# settings.clearAllDataOnly
source: 清空所有数据
en: Clear All Data

# settings.confirmClearAll
source: 这将删除所有页面且不注入任何演示数据。确定继续吗？
en: This will delete all pages without injecting any demo data. Continue?

# settings.confirmReset
source: 确认重置
en: Confirm Reset

# settings.exportMarkdown
source: 导出为单个 Markdown 文件
en: Export as Markdown

# settings.exportToFolder
source: 导出为 Markdown 文件夹 (多文件)
en: Export to Folder

# settings.graph3D
source: 3D 图谱
en: 3D Graph

# settings.healthCheck
source: 健康检查
en: Health Check

# settings.iCloudSync
source: iCloud 同步
en: iCloud Sync

# settings.importClipboard
source: 从剪贴板导入
en: Import from Clipboard

# settings.importComplete
source: 导入完成
en: Import Complete

# settings.importedPageTitle
source: 已导入页面
en: Imported Page

# settings.importFromFolder
source: 从文件夹导入
en: Import from Folder

# settings.importSuccess
source: 成功导入 %d 个页面
en: Successfully imported %d pages

# settings.importTag
source: 导入
en: imported

# settings.injectConfirm.message
source: 这将清空当前数据并注入一组预设的演示内容，确认执行吗？
en: This will clear current data and inject preset demo content. Continue?

# settings.injectConfirm.title
source: 注入演示数据
en: Inject Demo Data

# settings.injectDemo.successMessage
source: 成功注入 %d 条演示数据，界面已同步更新。
en: Successfully injected %d demo entries. UI has been updated.

# settings.injectDemoData
source: 注入演示数据
en: Inject Demo Data

# settings.language.chinese
source: 简体中文
en: Simplified Chinese

# settings.language.system
source: 跟随系统
en: Follow System

# settings.llmConfig
source: 在线大模型
en: Online LLM

# settings.llmNotConfigured
source: 未配置
en: Not Configured

# settings.maintenance
source: 知识治理与维护
en: Governance & Maintenance

# settings.developer.tab.data
source: 数据与维护
en: Data & Maintenance

# settings.developer.tab.quality
source: 质量评估
en: Quality Assessment

# settings.developer.section.performance_test
source: 性能测试
en: Performance Testing

# settings.developer.stressTest.count
source: 测试节点数量
en: Node Count

# settings.developer.stressTest.run
source: 运行压力测试
en: Run Stress Test

# settings.masterIndex
source: 总索引
en: Master Index

# settings.ok
source: 确定
en: OK

# settings.onDeviceLLM
source: 本地大模型
en: Local Model

# settings.operationLog
source: 操作日志
en: Operation Log

# settings.performanceTest
source: 性能压力测试
en: Performance Stress Test

# settings.performanceTestConfirm.message
source: 这将清空当前数据并注入 1000 条包含随机链接的测试节点。确认执行吗？
en: This will clear current data and inject 1000 test nodes with random links. Continue?

# settings.performanceTestConfirm.title
source: 启动压力测试
en: Start Stress Test

# settings.platform
source: 平台
en: Platform

# settings.privacyMode
source: 隐私模式
en: Privacy Mode

# settings.privacyMode.desc
source: 对标记为 #private 的内容执行高斯模糊
en: Blur content marked with #private

# settings.promptWorkshop
source: 提示词设置
en: Prompt Workshop

# settings.reset
source: 重置知识库
en: Reset ZhiYu

# settings.resetAllData
source: 重置所有数据
en: Reset All Data

# settings.resetOnboarding
source: 重置引导流程
en: Reset Onboarding

# settings.resetOnboarding.message
source: 确定要重新开始新手引导吗？
en: Are you sure you want to restart the onboarding process?

# settings.resetOnboarding.success
source: 引导流程已重置
en: Onboarding reset successfully

# settings.resetOnboarding.title
source: 重置引导
en: Reset Onboarding

# settings.resetWarning
source: 此操作将删除所有页面和日志，恢复为默认内容。不可恢复。
en: This will delete all pages and logs, restoring default content. Cannot be undone.

# settings.runPythonSeed
source: 执行脚本注入
en: Execute Script Injection

# settings.section.about
source: 关于
en: About

# settings.section.ai
source: 人工智能
en: AI

# settings.section.danger
source: 危险操作
en: Danger Zone

# settings.section.data
source: 数据管理
en: Data Management

# settings.section.developer
source: 开发者选项
en: Developer Options

# settings.section.importExport
source: 导入与导出
en: Import & Export

# settings.section.maintenance
source: 维护
en: Maintenance

# settings.section.moreFeatures
source: 更多功能
en: More Features

# settings.section.security
source: 安全与隐私
en: Security & Privacy

# settings.section.stats
source: 知识库统计
en: ZhiYu Statistics

# settings.section.system
source: 系统设置
en: System Settings

# settings.inject.noDataGenerated
source: 未能生成演示数据，请检查日志。
en: No demo data generated. Please check the logs.

# settings.settings
source: 设置
en: Settings

# settings.spatialComputing
source: 空间计算
en: Spatial Computing

# settings.stubPages
source: 占位页面
en: Stub Pages

# settings.systemLanguage
source: 系统语言
en: System Language

# settings.systemTheme
source: 系统主题
en: System Theme

# settings.tagManager
source: 标签管理
en: Tag Manager

# settings.theme.dark
source: 深色模式
en: Dark

# settings.theme.light
source: 浅色模式
en: Light

# settings.theme.system
source: 跟随系统
en: System

# settings.totalPages
source: 总页面
en: Total Pages

# settings.totalWords
source: 总字数
en: Total Words

# settings.unavailable
source: 不可用
en: Unavailable

# settings.version
source: 版本
en: Version

# settings.developer.section.data
source: 数据注入
en: Data Injection

# settings.developer.section.performance
source: 极限性能压测
en: Stress Testing

# settings.developer.section.system
source: 状态与重置
en: State & Reset

# settings.developer.section.dataReset
source: 数据重置
en: Data Reset

# settings.developer.section.operationInfo
source: 操作信息
en: Operation Information

# settings.developer.title
source: 开发者选项
en: Developer Options

# settings.developer.subtitle
source: 数据注入、压力测试与系统重置
en: Data injection, stress testing and system reset

# settings.developer.stressTest.1k
source: 压力测试 (1000 节点)
en: Stress Test (1000 nodes)

# settings.developer.stressTest.10k
source: 极限压测 (10000 节点)
en: Extreme Stress Test (10000 nodes)

# settings.developer.stressTest.success
source: 成功生成 %d 个压力测试节点
en: Successfully generated %d stress test nodes

# settings.developer.stressTest.confirmTitle
source: 执行压力测试
en: Run Stress Test

# settings.developer.stressTest.confirmAction
source: 确定 (清空数据并生成 %d 节点)
en: Confirm (Clear data and generate %d nodes)

# settings.developer.stressTest.confirmMessage
source: 此操作将清空当前数据库所有页面，仅用于性能测试。10000 节点可能会导致短时间卡顿。
en: This operation will clear all pages in the current database, used for performance testing only. 10000 nodes may cause brief stuttering.
